Autodesk.Revit.DB.IExportContextBase.OnText(Autodesk.Revit.DB.TextNode)
This method is called when a text annotation object is being output.
node:
An output node that represents a text annotation.

Autodesk.Revit.DB.IExportContextBase.OnPolylineSegments(Autodesk.Revit.DB.PolylineSegments)
This method is called after unhandled curve was tessellated to polyline segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D callsthis method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
segments:
A structure describing the polyline segments.

Autodesk.Revit.DB.IExportContextBase.OnLineSegment(Autodesk.Revit.DB.LineSegment)
This method is called after unhandled curve was tessellated to line segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D callsthis method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
segment:
A structure describing the line segment.

Autodesk.Revit.DB.IExportContextBase.OnPolyline(Autodesk.Revit.DB.PolylineNode)
This method is called when a Polyline is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
Note for 2D export: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Polyline.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(polyline segments) for this polyline, or otherwise return RenderNodeAction.Skip.
Note for 2D export: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.

Autodesk.Revit.DB.IExportContextBase.OnCurve(Autodesk.Revit.DB.CurveNode)
This method is called when a Curve is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
The curve can be one of the geometric object that derive from the Curve class, e.g. Line, Arc,
NurbeSpline, etc. To get to the specific properties of the particular class, the curve
obtained from the input node first needs to be cast accordingly depending on the curve's
actual type.
Note for 2D export: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Curve.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this curve, or otherwise return RenderNodeAction.Skip.
Note for 2D export: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.

Autodesk.Revit.DB.IExportContextBase
An interface that as common base for IModelExportContext and IExportContext2D.